# Actividad_15_Salarios

In [1]:
import pandas as pd
import numpy as np

In [4]:
dict_1 = {
    "Nombre":["Ringo","John","Paul","George","Yoko"],
    "Edad":[45,34,42,38,47],
    "Salario":[12000,14000,13000,11000,10000],
    "Genero":["M","M","M","M","F"]
}

In [5]:
data=pd.DataFrame(dict_1)

In [6]:
data.head()

   Nombre  Edad  Salario Genero
0   Ringo    45    12000      M
1    John    34    14000      M
2    Paul    42    13000      M
3  George    38    11000      M
4    Yoko    47    10000      F

In [7]:
data.median(numeric_only=True)

Edad          42.0
Salario    12000.0
dtype: float64

In [8]:
data.count()

Nombre     5
Edad       5
Salario    5
Genero     5
dtype: int64

In [9]:
print("La media de los salarios es: ",data["Salario"].mean())
print("La mediana de los salarios es: ",data["Salario"].mean())
print("La desviación estandar de los salarios es: ",data["Salario"].std())

La media de los salarios es:  12000.0
La mediana de los salarios es:  12000.0
La desviación estandar de los salarios es:  1581.1388300841897